[
  {
    "duration": "Aug 2021 - Present",
    "title": "Senior Software Engineer - Truminds",
    "desc": "Since joining Truminds in August 2021, I've been involved in diverse projects. I have managed front-end development teams across projects in IoT connectivity, MIS, and telecom services, collaborating with clients to refine and implement feature enhancements for optimal satisfaction. I have been involved in technical design discussions, oversaw portal redesigns, and integrated new features using Angular and React, ensuring alignment with client needs. I translated client requirements into clear Figma designs, worked with QA to improve testing procedures, and resolved issues quickly to maintain project timelines and deliverables.",
    "skills": [
      "Typescript",
      "JavaScript",
      "Angular",
      "ReactJS",
      "SASS",
      "Figma"
    ]
  },
  {
    "duration": "Feb 2021 - July 2021",
    "title": "Senior Software Engineer - IoT83",
    "desc": "Successfully migrated a ReactJS front-end portal to Angular, ensuring seamless functionality and performance throughout the transition. Focused on developing clean, readable code that adhered to design patterns and best practices while leading the technology and solution delivery for various product modules and components. I was part of code review and unit test cases to ensure full coverage. Collaborating with the QA team, I defined and validated functional test cases to improve software quality. I also participated in regular code reviews to maintain a high-quality codebase and promoted component reusability to boost efficiency and reduce redundancy. Throughout, I actively contributed to technical discussions, offering solutions and ideas.",
    "skills": ["Typescript", "Angular", "Jest", "SASS"]
  },
  {
    "duration": "Jun 2019 - Jan 2021",
    "title": "Software Engineer - ProfEdge Solutions",
    "desc": "I managed software development tasks, ensuring timely delivery and strict adherence to project schedules. I effectively troubleshot and resolved localization issues, documented solutions, and handled customer cases efficiently. Actively participating in code reviews, technical discussions, and whiteboard presentations, I contributed technical ideas and solutions. I analyzed and debugged technical issues, keeping clear comunication with customers and deployment teams. I managed multiple QA environments, coordinating closely with deployment teams for smoot transitions. I contributed to feature development and provided ongoing support for existing functionalities while interacting directly with clients to understand and meet their requirements. Additionally, I led the re-engineering of a Survey Platform application, migrating it from PHP to Angular.",
    "skills": ["Typescript", "JavaScript", "Angular", "SASS", "Figma"]
  },
  {
    "duration": "Nov 2018 - Apr 2019",
    "title": "Software Engineer - Arohar Technologies",
    "desc": "I contributed to multiple projects involving ASP .Net and AngularJS, where I handled a range of development tasks across different modules. My collaboration with the QA team was integral to the process, as we worked together to identify, track, and resolve bugs, ensuring that the final product met the highest quality standards. I played a key role in ensuring the timely delivery of new features by maintaining constant communication between the development and QA teams, coordinating workflows, and resolving any roadblocks efficiently. This cross-team collaboration helped to keep projects on schedule while delivering robust and reliable solutions to meet client expectations.",
    "skills": ["HTML", "CSS", "Javascript", "AngularJS", "ASP .Net", "SQL"]
  }
]
